Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Because an instance is not deallocated until after its deinitializer is called, a deinitializer can access all properties of the instance it is called on and can modify its behavior based on those properties (such as looking up the name of a file that needs to be closed).
ja: インスタンスはそれのデイニシャライザが呼ばれる後までは割り当て解除されないので、デイニシャライザはそれが呼ばれるところのインスタンスの全てのプロパティにアクセスすることができて、それらのプロパティに基づいてその挙動を修正することができます（たとえば閉じられる必要があるファイルの名前を調べることなど）。

source: Because argument labels are not part of a function’s type, you omit them when writing a function type.
ja: 引数ラベルは関数の型の一部ではないことから、あなたはそれらを関数型を書く時に省略します。

source: Because arrays conform to Collection and integers conform to Equatable, equalNumbers and differentNumbers can use the allEqual() method:
ja: それら配列はCollectionに準拠し、それら整数はEquatableに準拠することから、equalNumbersとdifferentNumbersはallEqual()メソッドを使うことができます：

source: Because both of them refer to the same closure, they both increment and return the same running total.
ja: それらの両方ともが同じクロージャを参照することから、それらは両方とも漸増しますそして同じ実行総数を返します。

source: Because both sides of the addition are now of type UInt16, the addition is allowed.
ja: 加算の両側が今では型UInt16であるので、加算は許されます。

source: Because classes are reference types, tenEighty and alsoTenEighty actually both refer to the same VideoMode instance.
ja: クラスが参照型であるので、tenEightyとalsoTenEightyは両方とも実際に同じVideoModeインスタンスに言及します。

source: Because classes are reference types, it’s possible for multiple constants and variables to refer to the same single instance of a class behind the scenes.
ja: クラスが参照型であるので、複数の定数と変数があるクラスの同じ１つのインスタンスに言及することが舞台裏で可能です。

source: Because declarations marked with the dynamic modifier are dispatched using the Objective-C runtime, they must be marked with the objc attribute.
ja: dynamic修飾子で印される宣言はObjective-Cランタイムを使ってディスパッチされるので、それらはobjc属性で印されなければなりません。

source: Because downcasting can fail, the type cast operator comes in two different forms.
ja: ダウンキャストは失敗することがありえるので、型キャスト演算子は２つの異なる書式になります。

source: Because each numeric type can store a different range of values, you must opt in to numeric type conversion on a case-by-case basis.
ja: それぞれの数の型は、値の異なる幅を格納できるので、あなたは数の型変換を一件一件を原則に決めていかなければなりません。

source: Because fatal errors are never optimized out, unlike assertions or preconditions, you can be sure that execution always halts if it encounters a stub implementation.
ja: 致命的なエラーは決して間違って最適化されません、表明や前提条件と違います、あなたは実行が常に停止することをそれがスタブ実装に遭遇する場合には確信できます。

source: Because implicit unwrapping changes the meaning of the declaration that contains that type, optional types that are nested inside a tuple type or a generic type—such as the element types of a dictionary or array—can’t be marked as implicitly unwrapped.
ja: 暗黙的にアンラップされることがその型を含む宣言の意味することを変えることから、タプル型や総称体型の内部に入れ子にされたオプショナル型—例えば辞書や配列に属する要素型など—は、暗黙的にアンラップされるように印されることはできません。

source: Because implicitly unwrapped optionals have the same Optional<Wrapped> type as optional values, you can use implicitly unwrapped optionals in all the same places in your code that you can use optionals.
ja: 暗黙的にアンラップされるオプショナルがオプショナル値と同じOptional<Wrapped>型を持つことから、あなたは、あなたのコードにおいてあなたがオプショナルを使うことができるのと同じ場所すべてで暗黙的にアンラップされるオプショナルを使うことができます。

source: Because it does not need to return a value, the function’s definition does not include the return arrow (->) or a return type.
ja: それが値を返す必要がないので、この関数の定義は戻り矢印（->）または戻り型を含みません。

source: Because it is an integer, it is rounded down during the division, so 16 becomes 1, 58 becomes 5, and 510 becomes 51.
ja: それが整数であるので、除算のときに端数を切り捨てられます、それで16が1に、58が5に、そして510は51になります。

source: Because it is in essence an “additive” operator, it has been given the same precedence group as additive infix operators such as + and -.
ja: それは本質的には「加法的な」演算子であるので、それは+や-といった加法的な接中辞演算子と同じ優先順位グループを与えられています。

source: Because it is marked with the lazy modifier, the DataImporter instance for the importer property is only created when the importer property is first accessed, such as when its filename property is queried:
ja: それがlazy修飾子という特徴をもつので、importerプロパティのためのDataImporterインスタンスは、importerプロパティが最初にアクセスされるsgにだけ作成されます、例えばそのfilenameプロパティがたずねられるときなど：

source: Because it is possible to request a key for which no value exists, a dictionary’s subscript returns an optional value of the dictionary’s value type.
ja: それに対する値が存在しないキーへの要請が可能であるので、ある辞書の添え字は、その辞書の値型のオプショナルの値を返します。

source: Because it provides a default value for all of the properties it introduces and does not define any initializers itself, ShoppingListItem automatically inherits all of the designated and convenience initializers from its superclass.
ja: それが、省略時の値をそれが導入するプロパティの全てに与えて、そしてまったくイニシャライザを定義しないので、ShoppingListItemはそのスーパークラスから自動的に指定および便宜イニシャライザの全てを継承します。

source: Because its type is RandomNumberGenerator, code inside the Dice class can only interact with generator in ways that apply to all generators that conform to this protocol.
ja: それの型がRandomNumberGeneratorであることから、Diceクラスの内部のコードは、全ての生成子にこのプロトコルに準拠することを適用するという方法でgeneratorと相互作用できるだけです。

source: Because it’s a generic type, Stack can be used to create a stack of any valid type in Swift, in a similar manner to Array and Dictionary.
ja: それが総称体型であるので、Stackは、ArrayとDictionaryに類似したやり方で、スウィフトにおけるあらゆる有効な型のスタックを作るために使われることができます。

source: Because it’s an alias, the call to AudioSample.min actually calls UInt16.min, which provides an initial value of 0 for the maxAmplitudeFound variable.
ja: それがエイリアスであるので、AudioSample.minへの呼び出しは実際にはUInt16.minを呼び、それは0の初期値をmaxAmplitudeFound変数のために提供します。

source: Because it’s not necessarily a mistake for code that calls the advance(to:) method to ignore the return value, this function is marked with the @discardableResult attribute.
ja: advance(to:)メソッドを呼び出して戻り値を無視することが必ずしもコードの誤りでないことから、この関数は@discardableResult属性で印されます。

source: Because it’s not practical to list every possible Character value in the example above, a default case handles any characters that are not matched.
ja: すべてのあり得るCharacter値を並べることは上の例では実際的ではないので、defaultケース節が適合しないあらゆる文字を取り扱います。

source: Because it’s of an optional type, the delegate property is automatically set to an initial value of nil.
ja: それがオプショナル型であるので、delegateプロパティは自動的に初期値のnilに設定されます。

source: Because multiline string literals use three double quotation marks instead of just one, you can include a double quotation mark (") inside of a multiline string literal without escaping it.
ja: 複数行文字列リテラルは、ただ１つではなく３つの二重引用符を使います、あなたは二重引用符（"）を複数行文字列リテラルの内部にそれをエスケープすることなく含めることができます。

source: Because of the special way that positive and negative numbers are stored, shifting either of them to the right moves them closer to zero.
ja: 正および負の数が格納される特別な方法のため、それらのどちらでも右へシフトすることは、それらをゼロの近くに動かします。

source: Because of the unowned customer reference, when you break the strong reference held by the john variable, there are no more strong references to the Customer instance:
ja: 非所有customer参照であることから、あなたがjohn変数によって保持される強い参照を壊すとき、Customerインスタンスへの強い参照はもうそれ以上ありません：

source: Because of this behavior, the switch cases case let (x, y): and case (let x, let y): match the same values.
ja: この挙動のため、switchケース節case let (x, y):とcase (let x, let y):は、同じ値にマッチします。

source: Because of this uncertainty, the as? form of the type cast operator returns an optional value when attempting to downcast to a subclass type.
ja: この不確実性のために、サブクラス型へのダウンキャストを試みるとき、型キャスト演算子のas?形式はオプショナルの値を返します。

source: Because of this, Swift provides an automatic argument label for every parameter in an initializer if you don’t provide one.
ja: これのため、スウィフトは、あなたがそれを独自に提供しないならば、自動的な引数ラベルをイニシャライザのあらゆるパラメータに用意します。

source: Because of this, all of the Int.Kind case values can be written in shorthand form inside the switch statement, such as .negative rather than Int.Kind.negative.
ja: そのことから、Int.Kindのケース節の値の全ては、switch文内で略記形式で書かれることができます、たとえばInt.Kind.negativeではなく.negativeのように。

source: Because of this, characters in Swift don’t each take up the same amount of memory within a string’s representation.
ja: これのため、スウィフトの中の文字は、それぞれが同じ量のメモリを文字列の表現において取るわけではありません。

source: Because of this, it isn’t possible to guarantee that this code will work for every possible type T, and an appropriate error is reported when you try to compile the code.
ja: このため、このコードがすべての可能な型Tのために機能することを保証することは可能ではありません、それであなたがこのコードをコンパイルしようとする場合は該当するエラーが報告されます。

source: Because of this, the call to john.residence?.address?.street fails.
ja: このことから、john.residence?.address?.streetへの呼び出しは、失敗します。

source: Because of this, the more general term instance is used.
ja: これのため、より一般的な語インスタンスが使われます。

source: Because of this, the raw value initializer always returns an optional enumeration case.
ja: そのため、生の値のイニシャライザは常にオプショナルの列挙ケース節を返します。

source: Because of type inference, Swift requires far fewer type declarations than languages such as C or Objective-C.
ja: 型推論のため、スウィフトはCまたはObjective-Cのような言語よりはるかに少ない型宣言しか必要としません。

source: Because one value is true, the overall expression also evaluates to true, and access is allowed:
ja: １つの値がtrueなので、式全体もまたtrueです、そしてアクセスは許可されます：

source: Because operators are functions, they can also have long-term accesses to their in-out parameters.
ja: これら演算が関数であることから、それらはまた長期アクセスをそれらのin-outパラメータに対して持つことができます。

source: Because optional patterns are syntactic sugar for Optional enumeration case patterns, the following are equivalent:
ja: オプショナルパターンはOptional列挙ケース節パターンに対する糖衣構文であるので、以下のものは等価です：

source: Because patterns represent the structure of a value rather than any one particular value, you can match them with a variety of values.
ja: パターンがどれかひとつの特定の値ではなく値の構造を表すので、あなたはそれをいろいろな値と照合（マッチング）できます。

source: Because property wrapper syntax is just syntactic sugar for a property with a getter and a setter, accessing height and width behaves the same as accessing any other property.
ja: プロパティラッパー構文がゲッターとセッターをもつプロパティに対する単なる糖衣構文であることから、heightとwidthにアクセスすることは、何か他のプロパティと同じ挙動をします。

source: Because protocols are types, begin their names with a capital letter (such as FullyNamed and RandomNumberGenerator) to match the names of other types in Swift (such as Int, String, and Double).
ja: プロトコルが型であるので、それらの名前を大文字で開始してください（例えばFullyNamedとRandomNumberGeneratorのように）、それによってスウィフトでの他の型の名前（例えばInt、String、およびDouble）と釣り合いがとれます。

source: Because superclass A and subclass B are defined in the same source file, it’s valid for the B implementation of someMethod() to call super.someMethod().
ja: スーパークラスAとサブクラスBが同じソースファイルにおいて定義されるので、B実装のsomeMethod()がsuper.someMethod()を呼ぶことは有効です。

source: Because the Hashable protocol conforms to Equatable, conforming types must also provide an implementation of the equals operator (==).
ja: HashableプロトコルがEquatableに準拠することから、準拠する型はまた同等演算子（==）のあるひとつの実装を提供しなければなりません。

source: Because the Rect structure provides default values for all of its properties, it receives a default initializer and a memberwise initializer automatically, as described in Default Initializers.
ja: Rect構造体がそのプロパティの全てに省略時の値を与えるので、省略時のイニシャライザで記述されるように、それは自動的に省略時のイニシャライザとメンバー関連イニシャライザを受け取ります。

source: Because the delegate property is an optional DiceGameDelegate, the play() method uses optional chaining each time it calls a method on the delegate.
ja: delegateプロパティがオプショナルのDiceGameDelegateであるので、play()メソッドは、それが委任先でメソッドを呼ぶたびにオプショナル連鎖を使います。

source: Because the first and second parameters are nonescaping functions, they can’t be passed as arguments to another nonescaping function parameter.
ja: firstおよびsecondパラメータは非脱出関数であることから、それらは引数として別の非脱出関数パラメータとして渡されることができません。

source: Because the vend(itemNamed:) method propagates any errors it throws, any code that calls this method must either handle the errors—using a do-catch statement, try?, or try!—or continue to propagate them.
ja: このvend(itemNamed:)メソッドはそれがスローするどんなエラーも伝達するので、このメソッドを呼び出す何らかのコードは、それらのエラーを取り扱うか ― do-catch文、try?、またはtry!を使って ― またはそれらの伝達を続けるか、どちらかをしなければなりません。

source: Because the vend(itemNamed:) method can throw an error, it’s called with the try keyword in front of it.
ja: vend(itemNamed:)メソッドはエラーをスローできることから、それはそれの前のtryキーワードとともに呼び出されます。

source: Because the switch must have a case for every possible character, not just every alphabetic character, this switch statement uses a default case to match all characters other than a and z.
ja: switchは、単にすべてのアルファベット文字ではなく、すべての可能な文字に対してひとつのケース節を持たなければならないことから、このswitch文はaとzのほかのすべての文字にマッチするためにdefaultケース節を使います。

source: Because the x, y, and z properties are all of an Equatable type, Vector3D receives synthesized implementations of the equivalence operators.
ja: x、y、そしてzプロパティはみんなEquatable型なので、Vector3Dは等価演算子の合成された実装それらを受け取ります。

source: Because the DiceGameDelegate protocol is class-only, you can declare the delegate to be weak to prevent reference cycles.
ja: DiceGameDelegateプロトコルがクラス専用であることから、あなたは委任先をweakであると宣言して参照循環を防ぐことができます。

source: Because the return type can be a tuple type, function types support functions and methods that return multiple values.
ja: return typeはタプル型であることが可能なので、関数型は複数の値を返す関数およびメソッドをサポートします。

source: Because the arithmetic addition operator is a binary operator, this operator method takes two input parameters of type Vector2D and returns a single output value, also of type Vector2D.
ja: 算術加算演算子は二項演算子なので、この演算子メソッドはVector2D型の２つの入力パラメーターを取り、同じくVector2D型のただ１つの出力値を返します。

source: Because the attempt to access numberOfRooms has the potential to fail, the optional chaining attempt returns a value of type Int?, or “optional Int”.
ja: numberOfRoomsにアクセスする試みは失敗する可能性があるので、オプショナル連鎖は型Int?の値、すなわち「オプショナルのInt」、を返すことを試みます。

source: Because the body of the closure is so short, it can even be written on a single line:
ja: クロージャの本文がたいへん短いので、それは１つの行に書かれさえすることができます：

source: Because the call to increment(forCount:) can fail for either of these two reasons, the call returns an optional Int value.
ja: increment(forCount:)への呼び出しがこれらの２つの理由のどちらによっても失敗する可能性があるので、呼び出しはオプショナルのInt値を返します。

source: Because the closure’s body contains a single expression (s1 > s2) that returns a Bool value, there is no ambiguity, and the return keyword can be omitted.
ja: クロージャの本文がある単一の式（s1 > s2）でBool値を返すものを含むので、曖昧さはありません、それでreturnキーワードは省略されることができます。

source: Because the data is nested, the enumeration used to store the data also needs to support nesting—this means the enumeration needs to be recursive.
ja: データが入れ子にされるため、データを格納するために使われる列挙もまた、入れ子をサポートする必要があります—これは列挙が再帰することを必要とするのを意味します。

source: Because the function returns a String value, greet(person:) can be wrapped in a call to the print(_:separator:terminator:) function to print that string and see its return value, as shown above.
ja: この関数はString値を返すので、上で見られるように、greet(person:)はprint(_:separator:terminator:)関数への呼び出しの中に包まれて、その文字列を出力してその戻り値を見ることができます。

source: Because the function’s return type is private, you must mark the function’s overall access level with the private modifier for the function declaration to be valid:
ja: 関数の戻り型が非公開であるので、あなたはこの関数宣言が有効になるために関数の全体的なアクセス水準にprivate修飾子で印しなければなりません：

source: Because the initializer might fail, it returns an optional Int, rather than an Int.
ja: このイニシャライザが失敗するかもしれないので、それはIntではなくて、オプショナルのIntを返します。

source: Because the key path string is created at compile time, not at runtime, the compiler can check that the property exists and that the property is exposed to the Objective-C runtime.
ja: キーパス文字列は実行時ではなく、コンパイル時に作成されるため、コンパイラはプロパティが存在することおよびプロパティがObjective-Cランタイムへと露出されることを確認できます。

source: Because the last line of badStart doesn’t end with a line break, that line gets combined with the first line of end.
ja: badStartの最後の行は改行で終わらないことから、その行はendの最初の行と結合されます。

source: Because the new Person instance has been assigned to the reference1 variable, there is now a strong reference from reference1 to the new Person instance.
ja: 新しいPersonインスタンスがreference1変数に代入されたので、強い参照が現在reference1から新しいPersonインスタンスまで存在します。

source: Because the players start off the board, on “square zero”, the board is initialized with 26 zero Int values, not 25.
ja: プレイヤーは、「正方形ゼロ」で盤を始めることから、この盤は26個のゼロInt値で初期化されます、25ではなく。

source: Because the sorting closure is passed as an argument to a method, Swift can infer the types of its parameters and the type of the value it returns.
ja: ソート（分類）するクロージャが引数としてメソッドに渡されるので、スウィフトは、それのパラメータの型とそれが返す値の型を推論することができます。

source: Because the temperature has increased to 40 degrees Fahrenheit, it is no longer cold enough to advise wearing a scarf and so the else branch is triggered instead.
ja: 温度が華氏40度まで増加したので、スカーフを着けることを助言するに足りるほどもはや寒くありません、それで代わりにelse分岐が作動させられます。

source: Because the temperature is neither too cold nor too warm to trigger the if or else if conditions, no message is printed.
ja: この気温はifまたはelse if条件の引き金になるにはあまり寒くもなくあまり暖かくもないので、メッセージは出力されません。

source: Because the tuple’s member values are named as part of the function’s return type, they can be accessed with dot syntax to retrieve the minimum and maximum found values:
ja: タプルの構成要素値は、この関数の戻り型の部分で命名されるので、それらは最小および最大の見つけられた値を取り出すためにドット構文でアクセスされることが出来ます。

source: Because the type alias and the existing type can be used interchangeably, the type alias can’t introduce additional generic constraints.
ja: 型エイリアスと既存の型は交換可能に使われることができるので、型エイリアスは追加的な総称体制約を導入することはできません。

source: Because the value of approximateCount falls between 12 and 100, naturalCount is assigned the value "dozens of", and execution is transferred out of the switch statement.
ja: approximateCountの値が12と100の間で失敗することから、naturalCountは、値"dozens of"を代入されます、そして実行はswitch文の外に移されます。

source: Because the value of the condition is evaluated after the statements are executed, the statements in a repeat-while statement are executed at least once.
ja: 文が実行された後で条件の値が評価されるので、repeat-while文の中の文は少なくとも一回は実行されます。

source: Because the value of the condition is evaluated before the statements are executed, the statements in a while statement can be executed zero or more times.
ja: 文が実行される前に、条件の値が評価されるので、while文の中の文は０回またはそれ以上実行される可能性を持ちます。

source: Because there are no more strong references to the Apartment instance, it too is deallocated:
ja: Apartmentインスタンスへの強い参照はもうこれ以上ないので、それも割り当て解除されます：

source: Because there are no more strong references to the Customer instance, it’s deallocated.
ja: Customerインスタンスへの強い参照はもうないので、それは割り当て解除されます。

source: Because there are no more strong references to the Person instance, it’s deallocated and the tenant property is set to nil:
ja: もうこれ以上Personインスタンスへの強い参照はないことから、それは割り当て解除されます、そしてtenant特性はnilに設定されます：

source: Because there are no other specific cases, integerToDescribe is matched by the default case.
ja: 他のいかなる特定のケース節もないことから、integerToDescribeはdefaultケース節に適合します。

source: Because there is at least one strong reference, ARC makes sure that this Person is kept in memory and is not deallocated.
ja: 少なくとも１つの強い参照があるので、ARCはこのPersonがメモリに保たれて割り当て解除されないことを確実にします。

source: Because these are value types, mutating any piece of the value mutates the whole value, meaning read or write access to one of the properties requires read or write access to the whole value.
ja: それらが値型であることから、その値の何か１つを変更することは値全体を変更し、プロパティの１つに対する読み出しや書き込みアクセスを意図することは値全体への読み出しや書き込みアクセスを必要とします。

source: Because these variables are of an optional type (Person?, not Person), they are automatically initialized with a value of nil, and do not currently reference a Person instance.
ja: これらの変数がオプショナル型（Personではなく、Person?）であることから、それらは自動的にnilの値で初期化されて、今はPersonインスタンスに参照をつけません。

source: Because they’re named types, you can extend their behavior to suit the needs of your program, using an extension declaration, discussed in Extensions and Extension Declaration.
ja: それらが名前付きの型であるので、あなたはそれらの挙動を、拡張および拡張宣言で議論される拡張宣言を使って、あなたのプログラムの必要に応じて拡張することができます。

source: Because this convenience initializer overrides a designated initializer from its superclass, it must be marked with the override modifier (as described in Initializer Inheritance and Overriding).
ja: この便宜イニシャライザがそれのスーパークラスからの指定イニシャライザをオーバーライドするので、それはoverride修飾子で印されなければなりません（イニシャライザの継承およびオーバーライドで記述されるように）。

source: Because this particular array has specified a value type of String, it is allowed to store String values only.
ja: この特定の配列がStringの値型を指定したので、それが貯蔵を許可されるのはString値のみです。

source: Because this particular set has specified a value type of String, it is only allowed to store String values.
ja: この問題の集合が明確に指定されたStringの値型を持つことから、それはString値を格納することだけが許されます。

source: Because this version of Residence stores an array of Room instances, its numberOfRooms property is implemented as a computed property, not a stored property.
ja: Residenceのこの改作がRoomインスタンスの配列を格納するので、そのnumberOfRoomsプロパティは計算プロパティとして実装されます、格納プロパティではなく。

source: Because your code can’t define properties that start with $ the projected value never interferes with properties you define.
ja: あなたのコードが$で始まるプロパティを定義できないことから予測値は決してあなたが定義するプロパティと干渉しません。

source: Before and after the update, you can read any information from the budget and get a correct answer, as shown in the figure below.
ja: 更新の前後で、あなたはあらゆる情報を予算案から読み出して正しい答えを得ることができます、下の図で示すように。

source: Before updating currentLevel, this method checks whether the requested new level is already unlocked.
ja: currentLevelを更新する前に、このメソッドは要請された新しいレベルがすでに錠を開けられるかどうか調べます。

source: Before you can fix the conflicting access, you have to determine what it was intended to do.
ja: あなたがこのアクセス衝突を修正するためには、あなたは実行を意図されたものは何かを判定する必要があります。

source: Behind the scenes, UInt16 has an initializer that accepts a UInt8 value, and so this initializer is used to make a new UInt16 from an existing UInt8.
ja: 舞台裏で、UInt16はUInt8値を受け入れるイニシャライザを持ちます、それでこのイニシャライザが新しいUInt16を既存のUInt8から作るために使われます。

source: Behind the scenes, Swift’s compiler optimizes string usage so that actual copying takes place only when absolutely necessary.
ja: 舞台裏で、スウィフトのコンパイラは、実際にコピーすることは絶対に必要なときだけ起こるように、文字列使用を最適化します。

source: Behind the scenes, Swift’s native String type is built from Unicode scalar values.
ja: 舞台裏で、スウィフト生得のString型はユニコードスカラー値によって組み立てられています。

source: Between one and eight hexadecimal digits
ja: １から８桁の16進数

source: Binary Expressions
ja: 二項式

source: Binary literals begin with 0b, octal literals begin with 0o, and hexadecimal literals begin with 0x.
ja: ２進のリテラルは0bから始まります、８進のリテラルは0oから始まります、そして16進のリテラルは0xから始まります。

source: Binary literals contain 0 and 1, octal literals contain 0 through 7, and hexadecimal literals contain 0 through 9 as well as A through F in upper- or lowercase.
ja: ２進のリテラルは0と1を含みます、８進のリテラルは0から7までを含みます、そして、16進のリテラルは0から9までに加えて大文字または小文字でのAからFまでを含みます。

source: Bitwise AND Operator
ja: ビット単位の論理積演算子

source: Bitwise Left and Right Shift Operators
ja: ビット単位の左および右シフト演算子

source: Bitwise NOT Operator
ja: ビット単位の論理否定演算子

source: Bitwise OR Operator
ja: ビット単位の論理和演算子

source: Bitwise Operators
ja: ビット単位演算子

source: Bitwise XOR Operator
ja: ビット単位の排他的論理和演算子

source: Bitwise left and right shifts have the effect of multiplying or dividing an integer by a factor of two.
ja: ビット単位の左または右シフトは、２の因数によって、ある整数を掛けるまたは割る効果を持ちます。

source: Bitwise operators can also be useful when you work with raw data from external sources, such as encoding and decoding data for communication over a custom protocol.
ja: ビット単位演算子はまた、あなたが外部のソースからの生のデータを扱うとき、役に立つことがありえます、例えば、あつらえのプロトコルを越えて通信するためのデータの符号化や復号など。

source: Blue numbers are shifted, gray numbers are discarded, and orange zeros are inserted:
ja: 青色の数はシフトされます、灰色の数は捨てられます、そしてオレンジ色のゼロが差し込まれます：

source: Boolean values are particularly useful when you work with conditional statements such as the if statement:
ja: あなたがif文のような条件つきの文で作業するとき、ブールの値は特に役に立ちます：

source: Boolean values are referred to as logical, because they can only ever be true or false.
ja: ブールの値は、論理として参照されます、なぜならそれらは真か偽であることだけができるからです。

source: Booleans
ja: ブール

source: Both String and Substring conform to the StringProtocol [https://developer.apple.com/documentation/swift/stringprotocol] protocol, which means it’s often convenient for string-manipulation functions to accept a StringProtocol value.
ja: StringとSubstringの両方ともStringProtocol [https://developer.apple.com/documentation/swift/stringprotocol]プロトコルに準拠します、それはStringProtocol値を受け取ることは文字列操作関数それぞれにとってしばしば都合が良いのを意味します。
